%跟数据库对接的各种协议。。。。

%% --------------------------------------------------------------------
%账号协议
-define(CS_ACCOUNT_LOGIN,11000).     %账号登陆

%% --------------------------------------------------------------------
%玩家协议
-define(CS_ROLE_CREATE_LOGIN,12000).     %角色创建并登陆进入游戏
-define(OP_PLAYER_MONEY,12001).          %操作玩家的钱
-define(OP_PLAYER_EXP,12002).            %操作玩家的经验
-define(OP_PLAYER_LEVEL,12003).          %操作玩家的等级
-define(CHECK_NAME,12001).               %检查同名玩家


%%---------------------------------------------------------------------
%家族相关
-define(OP_CREATE_FAIMLY,13000).         %创建家族的消息
-define(OP_PLAYER_ENTER,13001).          %玩家加入家族
-define(OP_PLAYER_LEAVE,13002).          %玩家离开家族
-define(OP_SAMENAME_FAMILY,13003).       %是否存在同名家族
-define(OP_DEL_FAMILY,13004).            %删除家族

%%---------------------------------------------------------------------
%排行榜相关
-define(OP_KILL_MAN,14000).              %杀人排行榜
-define(OP_KILL_MONSTER,14001).          %杀怪排行榜

%%---------------------------------------------------------------------
%任务相关
-define(OP_TASK_NUM,15000).             %玩家任务数量


%%---------------------------------------------------------------------
%服务器id相关
-define(OP_SERVER_ID,16000).            %操作获取服务器id


%%---------------------------------------------------------------------
%游戏版本相关
-define(OP_VERSION,17000).              %游戏的版本控制


%%--------------------------------------------------------------------
%玩家行为操作日志
-define(OP_LOGPLAYEROP,18000).    %玩家一条操作游戏行为










