%%%-------------------------------------------------------------------
%%% @author clark
%%% @copyright (C) 2015, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 08. 七月 2015 上午11:12
%%%-------------------------------------------------------------------
-author("clark").


%% 职业属性
-record(role_cfg,
{
    career,                 %% 职业
    lev,                    %% 等级
    level_up_exp,           %% 等级对应的经验
    attr,                   %% 属性值
    sp_exp,                 %% 体力兑换经验
    sp_gold                 %% 体力兑换金币
}).
