%%%-------------------------------------------------------------------
%%% @author fengzhu
%%% @copyright (C) 2016, <COMPANY>
%%% @doc 每日任务
%%%
%%% @end
%%% Created : 04. 一月 2016 下午2:51
%%%-------------------------------------------------------------------
-author("fengzhu").

-record(task_daily_star_cfg,
{
  id,         %% 本日常任务的玩家等级ID
  up_probo,   %% 1,任务升星概率。2,升星概率为一个含五个元素的列表，[P1,P2,P3,P4,P5]。比如：[20,20,30,20,10]。
  task_ids,   %% 任务ids [TaskId]
  prize       %% 奖励ID列表。比如：[3001,3002,3003,3004,3005]
}).